Revit 2027 API
DuctPressureDropData.HydraulicDiameter Property
 The hydraulic diameter of the duct. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HydraulicDiameter { get; set; }
Public Property HydraulicDiameter As Double
	Get
	Set
public:
property double HydraulicDiameter {
	double get ();
	void set (double value);
}
member HydraulicDiameter : float with get, set
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace